// Ниже код тестирования функции confirm

// let testingConfirm = confirm('Согласны с условиями конфеденциальности?');

// эта функция ждет ответа ок или отмена и возвращает true / false 


// alert(testingConfirm);// - true / false 



// prompt - возвращает написанное в поле вопроса значение, либо null

// Эта функция принимает два аргумента: prompt(title [default]); - как пример

// let question = prompt('Видишь вопрос?', '');
// alert(`хороший ответ :)`);




// Кодом ниже я запросил имя пользователя и вывел его на экран

// let questionName = prompt('Ваше имя?', '');

// alert(`Приятно познакомиться, ${questionName}, этот код написал Ваш сын :)`);