/*
Цикл while будет выполнять условия внутри пока они истины


*/

/*
let i = 0;

while (i < 3) {
    alert(i); // - вариант написания цикла while
    i++;
}
*/

/*
while (i) // - это более короткое написание while(i != 0)
*/



/*
цикл for

вбирает в себя (начало; условие; шаг){
    тело цикла
}

for (let i = 0; i < 3; i++){
    alert(i); - будет выводить 0 , 1 , 2 - причем еще в этом примере
    встроенная переменная, ее не будет видно за циклом
}

break - полностью прерывает цикл и передает управление на строку за телом

continue - цикл не прерывается , а переходит к следующей итерации

for (let i = 0; i < 4; i++) {
    if (i % 2.5 == 0) continue;
    alert(i);
}

*/
