/*
Не читать код ниже , подключать в скрипты

*/








































































































































// let ask = prompt('Вы на пути к веб студии? Отвечайте только Да или Нет', '');

// if (ask == 'Да') {
//     let secondAsk = prompt('Вы на верном пути, Вы видите время за которое сможете сделать?', '');
//     if (secondAsk == 'Да') {
//         alert('С Вами верная команда');
//     } else if (secondAsk == 'Нет') {
//         alert('Скоро Вы найдете решение');
//     } else if (secondAsk == null) {
//         alert('Отменено');
//     } else {
//         alert('Отвечайте только Да или Нет');
//     };
// } else if (ask == 'Нет') {
//     alert('Вы (возможно) сбились с пути');
// } else if (ask == null) {
//     alert('Отменено');
// } else {
//     alert('Отвечайте только Да или Нет');
// }