// операторы сравнения


/*
a > b , a < b // - самые обычные операторы сравнения
*/

/*
a >= b, a <= b // - значит a больше/меньше , либо равно b
*/

/*
a != b // означает , что a не равно b
*/

// все операторы сравнения возвращают логический тип данных true/false

/*
let result = 5 >= 4;

alert(result); // возвращает true
*/




// === строгое сравнение - оно не приводит данные к типам
// а если они отличаются, сразу возвращает false

/*
alert(0 == false); // - возвращает true , потому что оператор сравнения ==
// приводит разные типы данных к числу

alert(0 === false); // - возвразает false , потому что разные типы данных
*/


// !== - оператор строгого неравенства