// Это я начал изучать js и писать его уже наконец-таки )

'use strict';// - включил строгий режим (весь скрипт работает в современном режиме)

// alert('ошибочка');

// [1, 2].forEach(alert);

// let message; // - определение переменной

// message = 'Строка заданная в переменную месседж';

// alert(message); // - эта команда показывает содержимое переменной message 

// let message = 'Строка заданная в переменную месседж'; // - это тот же самый код, что и выше
// //только для удобства я сразу переменной присвоил строчное значение

// alert(message);

// в коде ниже в одну строку заданы три переменные, так можно делать, но лучше в одну друг за другом

// let people = 'Name', age = 25, message = 'Hello!';

// так 
// let people = 'Name';
// let age = 25;
// let message = 'Hello!';

const notchange = 'неизменная переменная';

let admin = 'John';

let name = 'John';

// alert(admin);

let ourPlanet = 'Земля';

let nameUser = '';