// alert(1 / 0);

//NaN - означает вычислительную ошибку, такое бывает в разных ситуациях
// - например, когда типы данных смешиваются 



//  в коде ниже смешано строчное значение и целочисленное

// alert('строка' * 2); //- поэтому, можно запистить этот код, и сразу увидеть NaN




// - Ниже о перевернутых кавычках


// let lastName = 'Твоя фамилия'; 

// let firstName = 'Твое имя';

//перевернутые кавычки расширяют функционал

// alert(`Привет, ${firstName + lastName}`); //  вычисляют переменные и преобразуют значения в строку




// Ниже о логических значениях - true / false

// let boolean = 4 > 1; // - создаю переменную и называю ее boolean

// // - Так как 4 больше одного - это является правдой

// // - и код ниже выводит это значение

// alert(boolean);


// null - используется для неизввестных значений

// typeof - возвращает тип данных typeof 'строка' - вернет 'string'
















